/* eslint-disable */
const {Markup} = require("telegraf");

module.exports = (bot) => {
  // ===Повідомлення від /help ===
  bot.command("help", (ctx) => {
    ctx.reply(
`Щоб отримати довідку по командах, натисніть на кнопки нижче.
Щоб викликати команду, пропишіть її через слеш "наприклад /add", або оберіть в меню зліва знизу`,
        Markup.inlineKeyboard([
          [Markup.button.callback("👋 help — Довідка по командах", "help_help")],
          [Markup.button.callback("⏰ setremind — Налаштувати нагадування", "help_setremind")],
          [Markup.button.callback("🧮 add — Додати новий запис", "help_add")],
          [Markup.button.callback("ℹ️ list — Перегляд/редагування", "help_list")],
        ]),
    );
  });

  // === "help" ===
  bot.action("help_help", (ctx) => {
    ctx.answerCbQuery();
    ctx.reply(
`Щоб скористатися, введіть "/help"
👋 Тут ви можете переглянути детальну інформацію про призначення та використання кожної команди.`,
    );
  });

  // === "setremind" ===
  bot.action("help_setremind", (ctx) => {
    ctx.answerCbQuery();
    ctx.reply(
`Щоб скористатися, введіть "/setremind"
⏰ За допомогою цієї команди ви можете налаштувати регулярність нагадувань про дні народження.
  Бот запропонує обрати часові проміжки (можна обрати декілька). Після налаштування <b>щодня о 7:00</b> за київським часом ви будете отримувати сповіщення, якщо в когось буде день народження.`,
    { parse_mode: 'HTML' }
    );
  });

  // === "add" ===
  bot.action("help_add", (ctx) => {
    ctx.answerCbQuery();
    ctx.reply(
`Щоб скористатися, введіть "/add"
🧮 Ця команда запускає покрокове додавання нового контакту:
  1. <b>Обов'язкові поля:</b> Введіть ім'я контакту та групу, до якої він належить
  2. <b>День народження:</b> Додайте дату у форматі ДД.ММ або ДД.ММ.РРРР
(Цей крок можна пропустити командою /skip)
  3. <b>Додаткова інформація:</b> Далі можна додати телефон, email, нотатки або створити власні поля зі значеннями.

"Підказка: Щоб візуально розрізняти контакти у списку, можна додавати на початку їхніх імен емодзі.`,
  { parse_mode: 'HTML' }
    );
  });

  // === "list" ===
  bot.action("help_list", (ctx) => {
    ctx.answerCbQuery();
    ctx.reply(
`Щоб скористатися, введіть "/list"
ℹ️ За допомогою цієї команди ви можете переглянути існуючі контакти.
Керування складається з трьох блоків:
  1. <b>Фільтри груп:</b> Кнопки для відображення або приховування контактів певної групи. Натискання на кнопку змінює її стан:
    '✅' — група відображається.
    '▫️' — група прихована.
  2. <b>Список контактів:</b> Пронумерований список контактів на поточній сторінці. Натисніть на кнопку з відповідним номером, щоб переглянути деталі або редагувати контакт
  3. <b>Навігація:</b> Кнопки для перегортання сторінок списку (з'являються, якщо контактів більше десяти).`,
  { parse_mode: 'HTML' }
    );
  });
};
